#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.create_role is tainted, so must be replaced
-/+ resource "aws_iam_policy" "create_role" {
      ~ arn         = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/CreateRoles" -> (known after apply)
      ~ id          = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/CreateRoles" -> (known after apply)
        name        = "CreateRoles"
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAUYKKR5SLH5UJ5ITHZ" -> (known after apply)
      - tags        = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
